## Exercise:

Write pandas that reports the most experienced employees in each project. In case of a tie, report all employees with the maximum number of experience years.

Return the result table in any order.

The query result format is in the following example.

In [6]:
import pandas as pd
import numpy as np

Project = pd.DataFrame({
    'project_id': [1, 1, 1, 2, 2],
    'employee_id': [1, 2, 3, 1, 4]
})
Employee = pd.DataFrame({
    'employee_id': [1, 2, 3, 4],
    'name': ['Khaled', 'Ali', 'John', 'Doe'],
    'experience_years': [3, 2, 3, 2]
})

In [7]:
Project.describe()

       project_id  employee_id
count    5.000000      5.00000
mean     1.400000      2.20000
std      0.547723      1.30384
min      1.000000      1.00000
25%      1.000000      1.00000
50%      1.000000      2.00000
75%      2.000000      3.00000
max      2.000000      4.00000

In [8]:
Project.dtypes

project_id     int64
employee_id    int64
dtype: object

In [12]:
Project.columns, Employee.columns, Project.shape

(Index(['project_id', 'employee_id'], dtype='object'),
 Index(['employee_id', 'name', 'experience_years'], dtype='object'),
 (5, 2))

In [16]:
joined_df = Project.merge(Employee, on='employee_id')
joined_df

   project_id  employee_id    name  experience_years
0           1            1  Khaled                 3
1           2            1  Khaled                 3
2           1            2     Ali                 2
3           1            3    John                 3
4           2            4     Doe                 2

In [22]:
joined_df['rank'] = joined_df.groupby(['project_id'])['experience_years'].rank(ascending=False, method='dense')
joined_df

   project_id  employee_id    name  experience_years  rank
0           1            1  Khaled                 3   1.0
1           2            1  Khaled                 3   1.0
2           1            2     Ali                 2   2.0
3           1            3    John                 3   1.0
4           2            4     Doe                 2   2.0

In [40]:
cond = joined_df['rank'] == 1
results = joined_df[cond][['project_id', 'employee_id']].sort_values('project_id').reset_index(drop=True)
results

   project_id  employee_id
0           1            1
1           1            3
2           2            1

In [41]:
# Define the expected output DataFrame
expected_output = pd.DataFrame({
    'project_id': [1, 1, 2],
    'employee_id': [1, 3, 1]
})


# Assert that the result DataFrame is equal to the expected output DataFrame
pd.testing.assert_frame_equal(results, expected_output)